Repository: potsawee/gf2-logicsim
Catalog: */*.po
Languages: th

source: is not set successfully.
th: ตั้งค่าผิดพลาด

source: is not set to 0.
th: ไม่ใช่ 0

source: is not set to 1.
th: ไม่ใช่ 1

source: is not zapped successfully.
th: เซปไม่สำเร็จ

source: is set to 0.
th: ตั้งค่าเป็น 0

source: is set to 1.
th: ตั้งค่าเป็น 1

source: is set.
th: ตั้งค่าสำเร็จ

source: is zapped.
th: เซปสำเร็จ

source: successfully.
th: สำเร็จ

source: &About
th: เกี่ยวกับ

source: &File
th: ไฟล์

source: &Help
th: ช่วยเหลือ

source: &Open
th: เปิด

source: &Quit
th: ปิด

source: About Logsim
th: เกี่ยวกับ ลอคซิม

source: Are you sure you want to quit the programme?
th: คุณแน่ใจหรือไม่ว่าจะปิดโปรแกรม

source: Browse
th: เลือก

source: Configuration
th: ตั้งค่า

source: Continue
th: ไปต่อ

source: Continue running.
th: รันต่อเนื่อง

source: Definition File Error
th: ไฟล์เออร์เรื่อ

source: File does not exist.
th: ไฟล์ไม่พบ

source: File loaded from
th: โหลดไฟล์จาก

source: Help
th: ช่วยเหลือ

source: Load
th: โหลด

source: Log Activity
th: ลอค

source: Logic Definition File Error.
th: โลจิกไฟล์ผิดพลาด

source: Maximum number of cycles per run (50) is reached.
th: รันได้สูงสุด 50 รอบ

source: Maximun number of monitors reached. Please zap monitor point(s) before setting.
th: จำนวนมอร์นิเตอร์สูงสุดได้ถึงแล้ว เอามอร์เตอร์บางตัวออก

source: Monitor
th: มอนิเจอต์

source: Monitors
th: มอนิเจอต์หลายตัว

source: Network is oscillating
th: วงจรไม่เสถียร

source: No monitor is available to be set.
th: จำนวนมอร์นิเตอร์บางตัวออก

source: No monitor is available to be set. Please load a file first.
th: เอามอร์เตอร์บางตัวออก

source: No monitor is available to be zapped.
th: จำนวนมอร์นิเตอร์สูงสุดได้ถึงแล้ว

source: No monitor is available to be zapped. Please load a file first.
th: จำนวนมอร์นิเตอร์สูงสุดได้ถึงแล้ว เอามอร์เตอร์บางตัวออก

source: No switch is available. Please load a file first.
th: จำนวนมอร์นิเตอร์สูงสุดได้ถึงแล้ว เอามอร์เตอร์บางตัวออก

source: No. of Clock Cycles
th: ฟดกาาสสแหืนกฟ

source: Open a circuit definition file
th: กดหฟำฟพเอิ

source: Operations
th: หาหาาหาห

source: Part IIA Project GF2 Logic Simulator Naitian Zheng (nz253) Potsawee Manakul (pm574) Shutong Feng (sf548) May 2018
th: พาร์ท สองเอ โปรเจค GF2 โลจิก ซิม ไนเทียน จาง พศวีร์ มานะกุล ซูธง เจี้อง พฤศถา 2018

source: Please do not alter monitor settings while running. Please press stop button first.
th: รกฟหกหอฟด หแแะ่ะกเิด

source: Please load a file before continuing.
th: ญสำฟหำสนฟกฟดรสำดนพำพีรืเ

source: Please load a file before running.
th: ยสำฟหำสนฟกฟดรสำ

source: Please load a valid file with .gf2 extension.
th: ยสำฟหำสนฟกฟอรำสไระ .gf2

source: Please refer to the user manual.
th: ยสำฟหำพำดำพะนะทฟืฟส

source: Please run before continuing.
th: ยสำฟหีพำฟนหรก่น

source: Please run before continuing.
th: ยสำฟหีพำฟนหรก่น

source: Quit
th: ๆีร

source: Run
th: พีฟหร

source: Set
th: หำะ

source: Start running.
th: หะฟพะพี

source: Stop
th: หะนย

source: Switch State
th: หไระแ้หะฟะ

source: Switches
th: หไระแห

source: The file does not exist. Please load a valid file.
th: ะฟหดรสำกนำหืนะำปรหะ

source: The maximum number of cycles per run is 50
th: ธำทฟปรืีทำพนดแัแหสหก 50 กำหะ

source: Warning
th: ไฟืพรืเ

source: Warning: network is oscillating.
th: ไฟพืรืเ: ะไนพารหนหแรสสฟะรืเ

source: Zap
th: ผฟย
